bluestore/onejob/read-4k.out
ceph-fuse-replicated: (g=0): rw=read, bs=4K-4K/4K-4K/4K-4K, ioengine=libaio, iodepth=32
ceph-fuse-erasure_1: (g=1): rw=read, bs=4K-4K/4K-4K/4K-4K, ioengine=libaio, iodepth=32
ceph-fuse-erasure_2: (g=2): rw=read, bs=4K-4K/4K-4K/4K-4K, ioengine=libaio, iodepth=32
ceph-kern-replicated: (g=3): rw=read, bs=4K-4K/4K-4K/4K-4K, ioengine=libaio, iodepth=32
ceph-kern-erasure_1: (g=4): rw=read, bs=4K-4K/4K-4K/4K-4K, ioengine=libaio, iodepth=32
ceph-kern-erasure_2: (g=5): rw=read, bs=4K-4K/4K-4K/4K-4K, ioengine=libaio, iodepth=32
fio-2.16
Starting 6 processes

ceph-fuse-replicated: (groupid=0, jobs=1): err= 0: pid=19082: Wed Feb 28 15:32:42 2018
  read : io=135700KB, bw=2261.7KB/s, iops=565, runt= 60001msec
    slat (usec): min=947, max=8305.9K, avg=1754.87, stdev=45092.86
    clat (usec): min=12, max=115650, avg=47210.87, stdev=6645.64
     lat (msec): min=1, max=8366, avg=48.97, stdev=45.67
    clat percentiles (msec):
     |  1.00th=[   39],  5.00th=[   41], 10.00th=[   43], 20.00th=[   44],
     | 30.00th=[   45], 40.00th=[   46], 50.00th=[   46], 60.00th=[   47],
     | 70.00th=[   48], 80.00th=[   49], 90.00th=[   55], 95.00th=[   59],
     | 99.00th=[   76], 99.50th=[   80], 99.90th=[   99], 99.95th=[  115],
     | 99.99th=[  116]
    bw (KB  /s): min=   63, max= 1994, per=74.40%, avg=1682.20, stdev=170.35
    lat (usec) : 20=0.01%
    lat (msec) : 2=0.01%, 4=0.01%, 10=0.01%, 20=0.02%, 50=83.49%
    lat (msec) : 100=16.38%, 250=0.08%
  cpu          : usr=1.39%, sys=2.28%, ctx=33939, majf=0, minf=54
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=99.9%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued    : total=r=33925/w=0/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=32
ceph-fuse-erasure_1: (groupid=1, jobs=1): err= 0: pid=19447: Wed Feb 28 15:32:42 2018
  read : io=99768KB, bw=1662.8KB/s, iops=415, runt= 60001msec
    slat (msec): min=1, max=46, avg= 2.39, stdev= 1.02
    clat (usec): min=10, max=138415, avg=74506.43, stdev=7657.21
     lat (msec): min=2, max=141, avg=76.90, stdev= 7.80
    clat percentiles (msec):
     |  1.00th=[   63],  5.00th=[   66], 10.00th=[   68], 20.00th=[   70],
     | 30.00th=[   72], 40.00th=[   73], 50.00th=[   74], 60.00th=[   75],
     | 70.00th=[   77], 80.00th=[   79], 90.00th=[   83], 95.00th=[   87],
     | 99.00th=[  106], 99.50th=[  111], 99.90th=[  118], 99.95th=[  126],
     | 99.99th=[  135]
    bw (KB  /s): min=  886, max= 1503, per=76.54%, avg=1272.16, stdev=91.61
    lat (usec) : 20=0.01%
    lat (msec) : 4=0.01%, 10=0.01%, 20=0.02%, 50=0.04%, 100=98.14%
    lat (msec) : 250=1.78%
  cpu          : usr=1.14%, sys=1.91%, ctx=24969, majf=0, minf=52
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=99.9%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued    : total=r=24942/w=0/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=32
ceph-fuse-erasure_2: (groupid=2, jobs=1): err= 0: pid=19933: Wed Feb 28 15:32:42 2018
  read : io=94932KB, bw=1582.2KB/s, iops=395, runt= 60002msec
    slat (msec): min=1, max=40, avg= 2.51, stdev= 1.10
    clat (usec): min=15, max=162539, avg=78293.85, stdev=9680.20
     lat (msec): min=2, max=165, avg=80.81, stdev= 9.88
    clat percentiles (msec):
     |  1.00th=[   65],  5.00th=[   69], 10.00th=[   70], 20.00th=[   73],
     | 30.00th=[   74], 40.00th=[   76], 50.00th=[   77], 60.00th=[   79],
     | 70.00th=[   81], 80.00th=[   84], 90.00th=[   88], 95.00th=[   95],
     | 99.00th=[  118], 99.50th=[  123], 99.90th=[  143], 99.95th=[  151],
     | 99.99th=[  163]
    bw (KB  /s): min=  820, max= 1687, per=90.14%, avg=1426.08, stdev=125.95
    lat (usec) : 20=0.01%
    lat (msec) : 4=0.01%, 10=0.01%, 20=0.02%, 50=0.05%, 100=96.58%
    lat (msec) : 250=3.33%
  cpu          : usr=1.24%, sys=1.79%, ctx=23787, majf=0, minf=52
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=99.9%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued    : total=r=23733/w=0/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=32
ceph-kern-replicated: (groupid=3, jobs=1): err= 0: pid=20177: Wed Feb 28 15:32:42 2018
  read : io=970196KB, bw=16169KB/s, iops=4042, runt= 60005msec
    slat (usec): min=12, max=13797, avg=94.15, stdev=75.31
    clat (usec): min=853, max=68081, avg=7816.40, stdev=6142.00
     lat (usec): min=921, max=68185, avg=7911.30, stdev=6145.83
    clat percentiles (usec):
     |  1.00th=[ 3312],  5.00th=[ 3984], 10.00th=[ 4128], 20.00th=[ 4640],
     | 30.00th=[ 5088], 40.00th=[ 5280], 50.00th=[ 5408], 60.00th=[ 5600],
     | 70.00th=[ 6112], 80.00th=[ 9024], 90.00th=[16192], 95.00th=[21888],
     | 99.00th=[31872], 99.50th=[37120], 99.90th=[47360], 99.95th=[54528],
     | 99.99th=[59136]
    bw (KB  /s): min= 4091, max=17770, per=53.29%, avg=8615.82, stdev=1979.69
    lat (usec) : 1000=0.01%
    lat (msec) : 2=0.12%, 4=5.31%, 10=75.98%, 20=12.31%, 50=6.20%
    lat (msec) : 100=0.07%
  cpu          : usr=3.92%, sys=20.42%, ctx=341069, majf=0, minf=52
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued    : total=r=242549/w=0/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=32
ceph-kern-erasure_1: (groupid=4, jobs=1): err= 0: pid=20471: Wed Feb 28 15:32:42 2018
  read : io=806012KB, bw=13432KB/s, iops=3358, runt= 60005msec
    slat (usec): min=16, max=5470, avg=101.06, stdev=59.21
    clat (msec): min=1, max=370, avg= 9.42, stdev= 7.17
     lat (msec): min=1, max=370, avg= 9.52, stdev= 7.17
    clat percentiles (msec):
     |  1.00th=[    5],  5.00th=[    7], 10.00th=[    7], 20.00th=[    7],
     | 30.00th=[    8], 40.00th=[    8], 50.00th=[    8], 60.00th=[    8],
     | 70.00th=[    9], 80.00th=[   10], 90.00th=[   16], 95.00th=[   20],
     | 99.00th=[   33], 99.50th=[   41], 99.90th=[   76], 99.95th=[  118],
     | 99.99th=[  293]
    bw (KB  /s): min=  187, max=10527, per=56.95%, avg=7649.26, stdev=1203.52
    lat (msec) : 2=0.01%, 4=0.29%, 10=82.12%, 20=12.88%, 50=4.40%
    lat (msec) : 100=0.24%, 250=0.05%, 500=0.01%
  cpu          : usr=3.90%, sys=20.07%, ctx=270528, majf=0, minf=54
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued    : total=r=201503/w=0/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=32
ceph-kern-erasure_2: (groupid=5, jobs=1): err= 0: pid=20565: Wed Feb 28 15:32:42 2018
  read : io=805888KB, bw=13431KB/s, iops=3357, runt= 60004msec
    slat (usec): min=19, max=4560, avg=107.59, stdev=58.41
    clat (msec): min=1, max=167, avg= 9.42, stdev= 5.86
     lat (msec): min=1, max=167, avg= 9.53, stdev= 5.86
    clat percentiles (msec):
     |  1.00th=[    5],  5.00th=[    6], 10.00th=[    7], 20.00th=[    7],
     | 30.00th=[    8], 40.00th=[    8], 50.00th=[    8], 60.00th=[    9],
     | 70.00th=[   10], 80.00th=[   11], 90.00th=[   16], 95.00th=[   20],
     | 99.00th=[   32], 99.50th=[   38], 99.90th=[   60], 99.95th=[  102],
     | 99.99th=[  165]
    bw (KB  /s): min= 6784, max=18688, per=99.98%, avg=13427.35, stdev=1695.69
    lat (msec) : 2=0.01%, 4=0.33%, 10=77.97%, 20=17.56%, 50=3.94%
    lat (msec) : 100=0.13%, 250=0.05%
  cpu          : usr=3.89%, sys=22.25%, ctx=263959, majf=0, minf=52
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued    : total=r=201472/w=0/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=32

Run status group 0 (all jobs):
   READ: io=135700KB, aggrb=2261KB/s, minb=2261KB/s, maxb=2261KB/s, mint=60001msec, maxt=60001msec

Run status group 1 (all jobs):
   READ: io=99768KB, aggrb=1662KB/s, minb=1662KB/s, maxb=1662KB/s, mint=60001msec, maxt=60001msec

Run status group 2 (all jobs):
   READ: io=94932KB, aggrb=1582KB/s, minb=1582KB/s, maxb=1582KB/s, mint=60002msec, maxt=60002msec

Run status group 3 (all jobs):
   READ: io=970196KB, aggrb=16168KB/s, minb=16168KB/s, maxb=16168KB/s, mint=60005msec, maxt=60005msec

Run status group 4 (all jobs):
   READ: io=806012KB, aggrb=13432KB/s, minb=13432KB/s, maxb=13432KB/s, mint=60005msec, maxt=60005msec

Run status group 5 (all jobs):
   READ: io=805888KB, aggrb=13430KB/s, minb=13430KB/s, maxb=13430KB/s, mint=60004msec, maxt=60004msec